evidencias/cenario-a-cold-start/teste Controlado (Cold Start & Isolamento) GraphQL.txt
teste Controlado (Cold Start & Isolamento) GraphQL

PS C:\ProjetosGit\tcc\tcc-api-performance> docker run --rm -i -v "${PWD}:/repo" -w /repo/k6 -e BASE_URL=http://host.docker.internal:8085 grafana/k6 run test-graphql.js

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: test-graphql.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m20s max duration (incl. graceful stop):
              * default: Up to 10 looping VUs for 50s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/10 VUs, 20 complete and 0 interrupted iterations
default   [   2% ] 01/10 VUs  01.0s/50.0s

running (0m02.0s), 02/10 VUs, 151 complete and 0 interrupted iterations
default   [   4% ] 02/10 VUs  02.0s/50.0s

running (0m03.0s), 03/10 VUs, 371 complete and 0 interrupted iterations
default   [   6% ] 03/10 VUs  03.0s/50.0s

running (0m04.0s), 04/10 VUs, 536 complete and 0 interrupted iterations
default   [   8% ] 04/10 VUs  04.0s/50.0s

running (0m05.0s), 05/10 VUs, 871 complete and 0 interrupted iterations
default   [  10% ] 05/10 VUs  05.0s/50.0s

running (0m06.0s), 06/10 VUs, 1179 complete and 0 interrupted iterations
default   [  12% ] 06/10 VUs  06.0s/50.0s

running (0m07.0s), 07/10 VUs, 1452 complete and 0 interrupted iterations
default   [  14% ] 07/10 VUs  07.0s/50.0s

running (0m08.0s), 08/10 VUs, 1629 complete and 0 interrupted iterations
default   [  16% ] 08/10 VUs  08.0s/50.0s

running (0m09.0s), 09/10 VUs, 2074 complete and 0 interrupted iterations
default   [  18% ] 09/10 VUs  09.0s/50.0s

running (0m10.0s), 09/10 VUs, 2559 complete and 0 interrupted iterations
default   [  20% ] 09/10 VUs  10.0s/50.0s

running (0m11.0s), 10/10 VUs, 3123 complete and 0 interrupted iterations
default   [  22% ] 10/10 VUs  11.0s/50.0s

running (0m12.0s), 10/10 VUs, 3695 complete and 0 interrupted iterations
default   [  24% ] 10/10 VUs  12.0s/50.0s

running (0m13.0s), 10/10 VUs, 4251 complete and 0 interrupted iterations
default   [  26% ] 10/10 VUs  13.0s/50.0s

running (0m14.0s), 10/10 VUs, 4697 complete and 0 interrupted iterations
default   [  28% ] 10/10 VUs  14.0s/50.0s

running (0m15.0s), 10/10 VUs, 5210 complete and 0 interrupted iterations
default   [  30% ] 10/10 VUs  15.0s/50.0s

running (0m16.0s), 10/10 VUs, 5719 complete and 0 interrupted iterations
default   [  32% ] 10/10 VUs  16.0s/50.0s

running (0m17.0s), 10/10 VUs, 6258 complete and 0 interrupted iterations
default   [  34% ] 10/10 VUs  17.0s/50.0s

running (0m18.0s), 10/10 VUs, 6713 complete and 0 interrupted iterations
default   [  36% ] 10/10 VUs  18.0s/50.0s

running (0m19.0s), 10/10 VUs, 7255 complete and 0 interrupted iterations
default   [  38% ] 10/10 VUs  19.0s/50.0s

running (0m20.0s), 10/10 VUs, 7817 complete and 0 interrupted iterations
default   [  40% ] 10/10 VUs  20.0s/50.0s

running (0m21.0s), 10/10 VUs, 8328 complete and 0 interrupted iterations
default   [  42% ] 10/10 VUs  21.0s/50.0s

running (0m22.0s), 10/10 VUs, 8843 complete and 0 interrupted iterations
default   [  44% ] 10/10 VUs  22.0s/50.0s

running (0m23.0s), 10/10 VUs, 9292 complete and 0 interrupted iterations
default   [  46% ] 10/10 VUs  23.0s/50.0s

running (0m24.0s), 10/10 VUs, 9821 complete and 0 interrupted iterations
default   [  48% ] 10/10 VUs  24.0s/50.0s

running (0m23.7s), 10/10 VUs, 10176 complete and 0 interrupted iterations
default   [  50% ] 10/10 VUs  25.0s/50.0s

running (0m24.7s), 10/10 VUs, 10645 complete and 0 interrupted iterations
default   [  52% ] 10/10 VUs  26.0s/50.0s

running (0m25.7s), 10/10 VUs, 11119 complete and 0 interrupted iterations
default   [  54% ] 10/10 VUs  27.0s/50.0s

running (0m26.7s), 10/10 VUs, 11521 complete and 0 interrupted iterations
default   [  56% ] 10/10 VUs  28.0s/50.0s

running (0m27.7s), 10/10 VUs, 11968 complete and 0 interrupted iterations
default   [  58% ] 10/10 VUs  29.0s/50.0s

running (0m28.7s), 10/10 VUs, 12520 complete and 0 interrupted iterations
default   [  60% ] 10/10 VUs  30.0s/50.0s

running (0m29.7s), 10/10 VUs, 13126 complete and 0 interrupted iterations
default   [  62% ] 10/10 VUs  31.0s/50.0s

running (0m30.7s), 10/10 VUs, 13755 complete and 0 interrupted iterations
default   [  64% ] 10/10 VUs  32.0s/50.0s

running (0m31.7s), 10/10 VUs, 14211 complete and 0 interrupted iterations
default   [  66% ] 10/10 VUs  33.0s/50.0s

running (0m32.7s), 10/10 VUs, 14621 complete and 0 interrupted iterations
default   [  68% ] 10/10 VUs  34.0s/50.0s

running (0m33.7s), 10/10 VUs, 14953 complete and 0 interrupted iterations
default   [  70% ] 10/10 VUs  35.0s/50.0s

running (0m34.7s), 10/10 VUs, 15276 complete and 0 interrupted iterations
default   [  72% ] 10/10 VUs  36.0s/50.0s

running (0m35.7s), 10/10 VUs, 15814 complete and 0 interrupted iterations
default   [  74% ] 10/10 VUs  37.0s/50.0s

running (0m36.7s), 10/10 VUs, 16367 complete and 0 interrupted iterations
default   [  76% ] 10/10 VUs  38.0s/50.0s

running (0m37.7s), 10/10 VUs, 16970 complete and 0 interrupted iterations
default   [  78% ] 10/10 VUs  39.0s/50.0s

running (0m38.7s), 10/10 VUs, 17491 complete and 0 interrupted iterations
default   [  80% ] 10/10 VUs  40.0s/50.0s

running (0m39.7s), 10/10 VUs, 18048 complete and 0 interrupted iterations
default   [  82% ] 10/10 VUs  41.0s/50.0s

running (0m40.7s), 09/10 VUs, 18454 complete and 0 interrupted iterations
default   [  84% ] 09/10 VUs  42.0s/50.0s

running (0m41.7s), 08/10 VUs, 18907 complete and 0 interrupted iterations
default   [  86% ] 08/10 VUs  43.0s/50.0s

running (0m42.7s), 07/10 VUs, 19316 complete and 0 interrupted iterations
default   [  88% ] 07/10 VUs  44.0s/50.0s

running (0m43.7s), 06/10 VUs, 19700 complete and 0 interrupted iterations
default   [  90% ] 06/10 VUs  45.0s/50.0s

running (0m44.7s), 05/10 VUs, 20049 complete and 0 interrupted iterations
default   [  92% ] 05/10 VUs  46.0s/50.0s

running (0m45.7s), 04/10 VUs, 20424 complete and 0 interrupted iterations
default   [  94% ] 04/10 VUs  47.0s/50.0s

running (0m46.7s), 03/10 VUs, 20723 complete and 0 interrupted iterations
default   [  96% ] 03/10 VUs  48.0s/50.0s

running (0m47.7s), 02/10 VUs, 20944 complete and 0 interrupted iterations
default   [  98% ] 02/10 VUs  49.0s/50.0s

running (0m48.7s), 01/10 VUs, 21065 complete and 0 interrupted iterations
default   [ 100% ] 01/10 VUs  50.0s/50.0s


  █ TOTAL RESULTS 

    checks_total.......: 21070   432.347712/s
    checks_succeeded...: 100.00% 21070 out of 21070
    checks_failed......: 0.00%   0 out of 21070

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=18.78ms min=51.9µs med=16.53ms max=699.35ms p(90)=28.58ms p(95)=33.9ms 
      { expected_response:true }...: avg=18.78ms min=51.9µs med=16.53ms max=699.35ms p(90)=28.58ms p(95)=33.9ms 
    http_req_failed................: 0.00%  0 out of 21070
    http_reqs......................: 21070  432.347712/s

    EXECUTION
    iteration_duration.............: avg=19.19ms min=4.78ms med=16.92ms max=712.99ms p(90)=29.22ms p(95)=34.42ms
    iterations.....................: 21070  432.347712/s
    vus............................: 1      min=1          max=10
    vus_max........................: 10     min=10         max=10

    NETWORK
    data_received..................: 5.0 MB 103 kB/s
    data_sent......................: 8.7 MB 179 kB/s



running (0m48.7s), 00/10 VUs, 21070 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  50s